export const frozenWords = ['форт-шевченко'];

export const frozenParts = [
  '-',
  ' ',
  'в',
  'на',
  'баден', // баден-Бадене
  'бледно',
  'буэнос',
  'вице', // вице-президенту
  'гаврилов',
  'йошкар', // Йошкар-Ола
  'коста',
  'лос',
  'норд',
  'нью', // Нью-Йорку,
  'орехово',
  'принс',
  'сан', // Сан-Франциско
  'санкт', // Санкт-Петербург
  'санта',
  'северо',
  'темно',
  'улан',
  'усолье', // Усолье-Сибирское
  'усть', // Усть-Каменогорске, Усть-Илимск
  'форт', // Форт-Шевченко
  'царь', // царь-пушке
  'экс', // экс-чемпиону
  'юго',
  'юрьев',
];

// do not decline words after this words
export const frozenPartsAfter = ['село', 'поселок', 'аул', 'город', 'деревня'];

export const customInflections = {
  exceptions: [
    {
      gender: 'androgynous',
      test: ['нижний', 'верхний'],
      mods: ['--его', '--ему', '', '-м', '--ем'],
    },
    {
      gender: 'androgynous',
      test: ['верхний', 'старый', 'новый', 'великий'],
      mods: ['--ого', '--ому', '', '-м', '--ом'],
    },
    {
      gender: 'androgynous',
      test: ['село'],
      mods: ['-а', '-у', '', 'м', '-е'],
    },
  ],
  suffixes: [
    {
      gender: 'androgynous',
      test: ['ий', 'ое'], // Волжский, Раменское
      mods: ['--ого', '--ому', '', '-м', '--ом'],
    },
    {
      gender: 'androgynous',
      test: ['ые'], // Набережные
      mods: ['-х', '-м', '', '-ми', '-х'],
    },
    {
      gender: 'androgynous',
      test: ['ий'], // Рижский
      mods: ['--ого', '--ому', '--ого', '-ми', '-х'],
    },
    {
      gender: 'androgynous',
      test: ['ая'], // Рижская
      mods: ['--ой', '--ой', '--ую', '--ой', '--ой'],
    },
    {
      gender: 'androgynous',
      test: ['иев'], // Сергиев Посад
      mods: ['а', 'у', '', 'ым', 'ом'],
    },
    {
      gender: 'androgynous',
      test: ['ны'], // Челны
      mods: ['-ов', '-ам', '', '-ами', '-ах'],
    },
  ],
};
